"""職業リスト
・市民
・人狼
・占い師
・霊媒師
・てるてる
"""



roles = {
    1: ["占い師", "人狼"],
    2: ["市民1", "人狼"],
    3: ["市民1", "占い師", "人狼"],
    4: ["市民1", "市民2", "占い師", "人狼"],
    5: ["市民1", "市民2", "市民", "占い師", "人狼"],
    6: ["市民1", "市民2", "霊媒師", "占い師", "狂人", "人狼"],
    7: ["市民1", "市民2", "市民3", "霊媒師", "占い師", "狂人", "人狼"],
    8: ["市民", "市民", "市民", "霊媒師", "占い師", "狂人", "人狼", "人狼"],
    9: ["市民", "市民", "市民", "市民", "霊媒師", "占い師", "狂人", "人狼", "人狼"],
    10: ["市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "狂人", "人狼", "人狼"],
    11: ["市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "狂人", "人狼", "人狼"],
    12: ["市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    13: ["市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    14: ["市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    15: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    16: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    17: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼"],
    18: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼", "人狼"],
    19: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼", "人狼"],
    20: ["市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "市民", "てるてる", "霊媒師", "占い師", "占い師", "占い師", "狂人", "人狼", "人狼", "人狼", "人狼"]
}
